#include <iostream>
#include <iomanip>
#include <fstream>
#include "MyString.h"
#include <string>


//Ванцевич Олег Сергеевич
//		9 группа

// B1
//	 Задан текстовый файл Input.txt, состоящий  из слов. 
//	 Разделителями между словами являются некоторое множество знаков препинания. 
//	 Из каждой строки удалить слова, длина которых больше длины последнего слова этой строки и
//	 записать эти строки  в новый файл Output.txt. Упорядочить слова  в полученных  строках по  возрастанию длин, результат сортировки записать в файл Out_sort.txt. 


//Описание алгоритма
//


			/*ТЕСТ No.1*/
//


			/*ТЕСТ No.2*/
//



using namespace std;



int main() {
	setlocale(LC_ALL, ".1251");
	ifstream input("Input.txt");
	

	system("pause");
	return 0;
}